Catalogs/ПакетыДокументовДля1САрхива.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ПакетыДокументовДля1САрхива</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГрифДоступа</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ГрифДоступаБИА</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПередачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПриемки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОрганизацияБИА</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Передал</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФизическоеЛицоБИА</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПодразделениеБИА</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Принял</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатПроверки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Создал</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФизическоеЛицоБИА</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусОбменаСАрхивом</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОбменаС1САрхивом</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьОтветственный</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СотрудникБИА</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Документы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДокументыБИА</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ОбменСАрхивомВызовСервера/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Скачивает контейнер документа из 1С:Архива и сохраняет его во временное хранилище.
//
// Параметры:
//  Документ - СправочникСсылка.ДокументыБИА - документ.
//
// Возвращаемое значение:
//  Структура:
//    * Имя - Строка - имя файла
//    * Расширение - Строка - расширение файла
//    * АдресДвоичныхДанных - Строка - адрес двоичных данных 
// 
Функция СкачатьКонтейнерДокумента(Знач Документ) Экспорт
	
	Если Не ЗначениеЗаполнено(Документ) Тогда
		ТекстОшибки = НСтр("ru = 'Ошибка при скачивании контейнера документа: параметр Документ не заполнен.'");
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	Если ТипЗнч(Документ) <> Тип("СправочникСсылка.ДокументыБИА") Тогда
		ТекстОшибки = НСтр("ru = 'Ошибка при скачивании контейнера документа: неожиданный тип параметра Документ'")
			+ " (" + ТипЗнч(Документ) + ").";
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ВебАдрес = Константы.АдресПубликации1САрхива.Получить();
	ИмяПользователя = Константы.ИмяПользователя1САрхива.Получить();
	Если Не ЗначениеЗаполнено(ВебАдрес) Тогда
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Не заполнена настройка ""%1"".'"),
			Метаданные.Константы.АдресПубликации1САрхива.Синоним);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ИмяПользователя) Тогда
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Не заполнена настройка ""%1"".'"),
			Метаданные.Константы.ИмяПользователя1САрхива.Синоним);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	ВладелецХранилища = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(
		Метаданные.Константы.ИмяПользователя1САрхива);
	Пароль = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(ВладелецХранилища);
	
	Если Не ЗначениеЗаполнено(ВебАдрес) Тогда
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Не заполнена настройка ""%1""'"),
			Метаданные.Константы.АдресПубликации1САрхива.Синоним);
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ИмяПользователя) Тогда
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Не заполнена настройка ""%1""'"),
			Метаданные.Константы.ИмяПользователя1САрхива.Синоним);
	КонецЕсли;
	
	СтруктураURI = ОбщегоНазначенияКлиентСервер.СтруктураURI(ВебАдрес);
	ИнтернетПрокси = Неопределено;
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ПолучениеФайловИзИнтернета") Тогда
		МодульПолучениеФайловИзИнтернета = ОбщегоНазначения.ОбщийМодуль("ПолучениеФайловИзИнтернета");
		ИнтернетПрокси = МодульПолучениеФайловИзИнтернета.ПолучитьПрокси(СтруктураURI.Схема);
	КонецЕсли;
	
	Таймаут = 120;
	WSОпределения = Новый WSОпределения(ВебАдрес + "/ws/ArchiveDocuments.1cws?wsdl",
		 ИмяПользователя, Пароль, ИнтернетПрокси, Таймаут);
	Прокси = Новый WSПрокси(WSОпределения, "http://www.1c.ru/docmng",
		 "ArchiveDocuments", "ArchiveDocumentsSoap", ИнтернетПрокси, Таймаут);
	Прокси.Пользователь = ИмяПользователя;
	Прокси.Пароль = Пароль;
	
	ДанныеФайла = Прокси.GetContainer(ОбменСАрхивом.ИдентификаторСсылки(Документ));
	СведенияОФайлеДляКлиента = Новый Структура;
	СведенияОФайлеДляКлиента.Вставить("Имя", Строка(ДанныеФайла.Name));
	СведенияОФайлеДляКлиента.Вставить("Расширение", Строка(ДанныеФайла.Extension));
	СведенияОФайлеДляКлиента.Вставить("АдресДвоичныхДанных",
		ПоместитьВоВременноеХранилище(ДанныеФайла.BinaryData));
	
	Возврат СведенияОФайлеДляКлиента;
	
КонецФункции

// Получает список ссылок на объекты для отбора в истории обмена.
//
// Параметры:
//  ОбъектСсылка - ОпределяемыйТип.СсылкаНаИнтегрируемыйОбъектБИА - интегрируемый объект.
//
// Возвращаемое значение:
//  Массив из СправочникСсылка.ДокументыБИА, ОпределяемыйТип.СсылкаНаИнтегрируемыйОбъектБИА,
//    СправочникСсылка.ПакетыДокументовДля1САрхива - объекты для просмотра истории:
//    сам объект, его документы БИА, пакет документов.
//
Функция ОбъектыИсторииОбменаПоОбъекту(Знач ОбъектСсылка) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ДокументыБИА.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ДокументыБИАПоОбъекту
		|ИЗ
		|	Справочник.ДокументыБИА КАК ДокументыБИА
		|ГДЕ
		|	(ДокументыБИА.ОбъектОснование = &ОбъектСсылка ИЛИ ДокументыБИА.Ссылка = &ОбъектСсылка)
		|	И НЕ ДокументыБИА.ПометкаУдаления
		|
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&ОбъектСсылка КАК ОбъектИстории
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ДокументыБИАПоОбъекту.Ссылка
		|ИЗ
		|	ДокументыБИАПоОбъекту КАК ДокументыБИАПоОбъекту
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ДокументыБИА.ОбъектОснование
		|ИЗ
		|	Справочник.ДокументыБИА КАК ДокументыБИА
		|ГДЕ
		|	Ссылка = &ОбъектСсылка
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ПакетыТабЧасть.Ссылка
		|ИЗ
		|	Справочник.ПакетыДокументовДля1САрхива.Документы КАК ПакетыТабЧасть
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыБИАПоОбъекту КАК ДокументыБИАПоОбъекту
		|		ПО ПакетыТабЧасть.Документ = ДокументыБИАПоОбъекту.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПакетыДокументовДля1САрхива КАК Пакеты
		|		ПО ПакетыТабЧасть.Ссылка = Пакеты.Ссылка
		|ГДЕ
		|	НЕ Пакеты.ПометкаУдаления");
	
	Запрос.УстановитьПараметр("ОбъектСсылка", ОбъектСсылка);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0);
	
КонецФункции

// См. ОбменСАрхивом.ФизЛицоТекущегоПользователя
// 
Функция ФизЛицоТекущегоПользователя() Экспорт
	
	Возврат ОбменСАрхивом.ФизЛицоТекущегоПользователя();
	
КонецФункции

// Описание.
//
// Параметры:
//  ОбъектСсылка - ОпределяемыйТип.СсылкаНаИнтегрируемыйОбъектБИА - интегрируемый объект.
//
// Возвращаемое значение:
//  Структура - данные, необходимые для взаимодействия с пользователем при отзыве документа:
//  * СтатусОбмена - ПеречислениеСсылка.СтатусыОбменаС1САрхивом - статус обмена.
// 
Функция ДанныеОДокументеДляОтзыва(ОбъектСсылка) Экспорт
	
	Данные = Новый Структура;
	Данные.Вставить("СтатусОбмена", РегистрыСведений.СтатусыОбменаДокументовБИА.СтатусДокумента(ОбъектСсылка));
	
	Возврат Данные;	
	
КонецФункции

#КонецОбласти
